In [181]:
# 머신러닝에서 가장 중요한 데이터의 표현을 numpy를 통해 알 수 있었습니다.
# Pandas는 행과 열로 이루어진 2차원의 데이터를 쉽게 처리할 수 있도록 다양한 기능을 제공합니다. 넘파이에 대해 공부하고 보시는걸 추천드립니다!
# 실행하기 전 어떤 결과가 나올지 생각해 보세요!

# 우선 Pandas 모듈을 불러옵니다, pandas는 너무 길기 때문에 pd로 축약해서 표현합니다.
import pandas as pd

# 만약 모듈이 없다고 뜨면 터미널 PS C:\Users\파일이름> pip install pandas를 쳐주세요

In [224]:
# 판다스는 다양한 파일을 데이터프레임으로 로딩할 수 있는 편리한 API 제공합니다.
# API가 무엇인지 고민하지 말고 코드를 통해 알아봅시다.

# read_csv(): 괄호 안에 파일 경로를 적으면 해당하는 csv파일을 로딩합니다.
# 예시로 깃허브에 있는 타이타닉 데이터를 로딩해 봅시다. 
titanic_df = pd.read_csv('https://raw.githubusercontent.com/HanXiaoyang/Kaggle_Titanic/master/train.csv')
print('titanic_df 변수 type: ', type(titanic_df))

titanic_df 변수 type:  <class 'pandas.core.frame.DataFrame'>

In [245]:
# DataFrame.head(): 괄호 안의 인자 수만큼 순서대로 행을 출력합니다.
print(titanic_df.head(4))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S

In [246]:
# DataFrame.shape: 데이터프레임의 행과 열을 튜플 형태로 출력합니다.
print(titanic_df.shape)

(891, 12)

In [247]:
# DataFrame.info(): 데이터프레임의 총 데이터건수, 데이터 타입, Null건수를 출력합니다.
# null은 비어있는 곳을 의미합니다.
print(titanic_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [248]:
# DataFrame.describe(): 숫자형 데이터 값의 분포, 평균, 최댓값, 최솟값을 알려줍니다. (문자형은 출력에서 제외됩니다.)
# count값는 non-null개수를 의미합니다.
print(titanic_df.describe())

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   13.002015    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   22.000000    0.000000
50%     446.000000    0.000000    3.000000   29.699118    0.000000
75%     668.500000    1.000000    3.000000   35.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [249]:
# Series.value_counts() : 지정된 컬럼의 데이터 값의 개수를 알려줍니다.
# -> value_counts()는 Series(데이터프레임의 하나의 열) 형태의 데이터에만 사용 가능합니다.
print(titanic_df['Survived'].value_counts())

0    549
1    342
Name: Survived, dtype: int64

In [250]:
# pandas의 데이터 프레임은 리스트와 넘파이의 ndarray와 다르게 column(열) 이름을 가지고 있습니다. 
# ex) 타이타닉 데이터의 Survived칼럼, Pclass칼럼...
# 하지만 리스트와 ndarray도 pandas를 이용하면 칼럼명을 생성할 수 있습니다.

# 넘파이의 ndarray로 예시
import numpy as np
col_name1 = ['col 1']
array1 = np.arange(1,4)
print('원래의 데이터:\n',array1)

# 이제 이 1차원의 ndarray를 이용해 데이터 프레임을 생성합니다.
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('\n1차원 ndarray로 만든 DataFrame: \n', df_array1)

# 만약 2차원 형태의 ndarray를 이용하면 더 많은 칼럼을 지정할 수 있습니다.
col_name2 = ['col 1', 'col 2', 'col 3', 'col 4', 'col 5']
array2 = np.arange(1, 11)
array_2d = array2.reshape(2,5)
df_array_2d = pd.DataFrame(array_2d, columns=col_name2)
print('\n2차원 ndarray로 만든 DataFrame:\n', df_array_2d)

원래의 데이터:
 [1 2 3]

1차원 ndarray로 만든 DataFrame:
    col 1
0      1
1      2
2      3

2차원 ndarray로 만든 DataFrame:
    col 1  col 2  col 3  col 4  col 5
0      1      2      3      4      5
1      6      7      8      9     10

In [251]:
# 이번에는 반대로 DataFrame을 넘파이 ndarray로 바꿀 수 있습니다.

# DataFrame.values: 데이터 프레임을 ndarray로 바꿔줍니다.
# 방금 만든 df_arryay_2d를 바꿔보겠습니다. 
array3 = df_array_2d.values
print('df_array_2d.values shape: ', array3.shape)
print(array3)

df_array_2d.values shape:  (2, 5)
[[ 1  2  3  4  5]
 [ 6  7  8  9 10]]

In [252]:
# pandas를 이용하면 데이터프레임에 새로운 칼럼을 추가할 수 있습니다.
# 타이타닉 데이터에 Age_0이라는 새로운 칼럼을 추가하고, 일괄적으로 값을 0으로 할당해 보겠습니다.
titanic_df['Age_0'] = 0
print(titanic_df.head(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked  Age_0
0      0         A/5 21171   7.2500   NaN        S      0
1      0          PC 17599  71.2833   C85        C      0
2      0  STON/O2. 3101282   7.9250   NaN        S      0

In [253]:
# 하지만 머신러닝에 필요하지 않는 데이터를 사용하면 효율이 떨어집니다.
#  방금 Age_0칼럼을 추가한 것처럼 삭제할 수도 있습니다.

# drop(): 데이터를 삭제하는데 사용됩니다. 
# DaataFrame.drop(labels="A", axis="B", index= , columns= , level= , inplace="C", errors=, )

# "A"의 값은 삭제할 컬럼명 지정, 여러개를 지울 때는 리스트로 넣을 수 있습니다.
# "B"의 값으로 0과 1이 있습니다.
# --> axis = 0: 해당하는 행(row)을 삭제합니다. 
# --> axis = 1: 해당하는 열(column)을 삭제합니다.
# "C"의 값으로 False와 True가 있습니다.
# --> inplace = False: 원본 데이터를 그대로 유지한 채 삭제합니다.
# --> inplace = True: 원본 데이터의 값을 삭제합니다.

# 코드를 보면서 이해해 보세요!

In [254]:
# 방금 추가한 Age_0 칼럼을 삭제하겠습니다.
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
print(titanic_drop_df.head(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

In [255]:
# 하지만 원본 titanic_df를 보면 Age_0칼럼이 삭제되지 않았습니다.
print(titanic_df.head(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked  Age_0
0      0         A/5 21171   7.2500   NaN        S      0
1      0          PC 17599  71.2833   C85        C      0
2      0  STON/O2. 3101282   7.9250   NaN        S      0

In [256]:
# inplace = True 로 두어 원본 데이터프레임에서도 삭제합니다.
titanic_df.drop('Age_0', axis=1, inplace=True)
print(titanic_df.head(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

In [257]:
# DataFrame.index 또는 Series.index 를 통해 인덱스 객체만 추출할 수 있습니다.

# Index 객체 추출
index = titanic_df.index

# reset_index(): 새로운 index를 연속 숫자형으로 할당하고, 기존 index는 index라는 새로운 컬럼명으로 추가합니다.
#-->기존 index가 연속형 int 숫자형이 아닐 경우 이를 다시 연속형 int 숫자로 만들 때 주로 사용합니다.
titanic_reset_df = titanic_df.reset_index(inplace=False)
print(titanic_reset_df.head(3))

   index  PassengerId  Survived  Pclass  \
0      0            1         0       3
1      1            2         1       1
2      2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

In [258]:
# DataFrame은 여러 방법을 통해서 원하는 데이터를 선택할 수 있습니다!

# 1. 가장 기본적인 DataFrame[]방식
# 단일 칼럼 데이터를 추출합니다. 
print(titanic_df['Pclass'].head(8))
print()
# 여러 칼럼 데이터를 추출합니다. 여러 칼럼명을 리스트 형태로 작성합니다:['Survived', 'Pclass', 'Age']
print(titanic_df[['Survived', 'Pclass', 'Age']].head(8))
print()

# 2. DataFrame.iloc[로우 인덱스,칼럼 인덱스]방식
print(titanic_df.iloc[0, 3]) #Braund, Mr. Owen Harris출력
# ':'을 이용하면 여러 값도 불러올 수 있습니다.
print(titanic_df.iloc[0:4, 3:6])
print()

# 3. DataFrame.loc[로우 인덱스, 칼럼명]방식
# 특정 칼럼의 값도 불러올 수 있습니다.
print(titanic_df.loc[4, 'Name']) #Allen, Mr. William Henry출력
# 콜론을 이용하면 여러 값도 불러올 수 있지만 인덱스 값을 조심해야 합니다.
# 보통[2:7]-> 2부터 6까지, loc[2:7]-> 2부터 7까지
print(titanic_df.loc[2:7, 'Survived'])
print()

# 4. 불린 인덱싱 방식
print(titanic_df.loc[titanic_df['Age']>60,['Age', 'Survived']].head(3))
print()
# 여러 개의 복합 조건을 이용해서도 불린 인덱싱이 가능
#    and 조건.: &
#    or 조건 : |
#    Not 조건 : ~
print(titanic_df[ (titanic_df['Age']>60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')])

0    3
1    1
2    3
3    1
4    3
5    3
6    1
7    3
Name: Pclass, dtype: int64

   Survived  Pclass        Age
0         0       3  22.000000
1         1       1  38.000000
2         1       3  26.000000
3         1       1  35.000000
4         0       3  35.000000
5         0       3  29.699118
6         0       1  54.000000
7         0       3   2.000000

Braund, Mr. Owen Harris
                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0

Allen, Mr. William Henry
2    1
3    1
4    0
5    0
6    0
7    0
Name: Survived, dtype: int64

     Age  Survived
33  66.0         0
54  65.0         0
96  71.0         0

     PassengerId  Survived  Pclass                                       Name  \
275          276         1       1          Andrews, Miss. Kornelia Theodosia
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)

        Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275  female  63.0      1      0   13502  77.9583    D7        S
829  female  62.0      0      0  113572  80.0000   B28      NaN

In [259]:
# 넘파이의 sort()처럼 DataFrame을 sort_values()를 이용하여 정리할 수 있습니다.

titanic_sorted = titanic_df.sort_values(by=['Pclass'])
print(titanic_sorted.head(3)) # Pclass칼럼을 확인해 주세요!
print()
# 만약 내림차순으로 정리하고 싶으면 ascending=False 추가합니다.
titanic_sorted_down = titanic_df.sort_values(by=['Pclass'], ascending=False)
print(titanic_sorted_down.head(3))

     PassengerId  Survived  Pclass                            Name     Sex  \
445          446         1       1       Dodge, Master. Washington    male
310          311         1       1  Hays, Miss. Margaret Bechstein  female
309          310         1       1  Francatelli, Miss. Laura Mabel  female

      Age  SibSp  Parch    Ticket     Fare Cabin Embarked
445   4.0      0      2     33638  81.8583   A34        S
310  24.0      0      0     11767  83.1583   C54        C
309  30.0      0      0  PC 17485  56.9292   E36        C

     PassengerId  Survived  Pclass                     Name   Sex        Age  \
0              1         0       3  Braund, Mr. Owen Harris  male  22.000000
511          512         0       3        Webber, Mr. James  male  29.699118
500          501         0       3         Calic, Mr. Petar  male  17.000000

     SibSp  Parch            Ticket    Fare Cabin Embarked
0        1      0         A/5 21171  7.2500   NaN        S
511      0      0  SOTON/OQ 3101316  8.0500   NaN        S
500      0      0            315086  8.6625   NaN        S

In [260]:
# Aggregation 함수를 이용하면 각 칼럼의  평균, 최댓값, 총합, non-null값의 개수 집계를 알 수 있습니다.
# Aggregation 함수 종류 : min(), max(), sum(), count()
print('평균 나이:',titanic_df['Age'].mean(), '\n각 칼럼의 non-null값: \n',titanic_df[['Cabin', 'Embarked']].count())

평균 나이: 29.69911764705882
각 칼럼의 non-null값:
 Cabin       204
Embarked    889
dtype: int64

In [261]:
# groupby(): 특정 칼럼에 대해 데이터를 정리하는 방법입니다.

# 좌석등급에 따라 데이터를 정리해 보겠습니다.
titanic_groupby = titanic_df.groupby('Pclass')[['Cabin', 'Embarked']].count()
print(titanic_groupby)
print()

# 여러개의 Aggregation함수를 적용하기 위해서는 agg를 이용합니다.
print(titanic_df.groupby('Pclass')['Age'].agg(['max', 'min']))
print()
# 여러개의 칼럼에 Aggregation함수를 적용하기 위해서는 agg인자에 딕셔너리를 사용합니다.
agg_format = {'Age':'max', 'Fare':'mean'}
print(titanic_df.groupby('Pclass').agg(agg_format))

        Cabin  Embarked
Pclass
1         176       214
2          16       184
3          12       491

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

         Age       Fare
Pclass
1       80.0  84.154687
2       70.0  20.662183
3       74.0  13.675550

In [262]:
# 넘파이에서 NaN은 판다스에서null값을 의미합니다. (null은 비어있는 값을 의미합니다.)
# 머신러닝에서 null은 문제가 되기 때문에 다른 값으로 대체해야합니다.

# isnull() 또는 isna()를 이용해 NaN값 여부를 확인합니다.
print(titanic_df.isnull().head(3))
print()
# True가 Null값이 있음을 의미합니다.

# sum()을 이용하여 한번에 확인합니다.
print(titanic_df.isnull().sum())

# Age와 Cabin에 비어있는 값이 있다는것을 확인할 수 있습니다.

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket  \
0        False     False   False  False  False  False  False  False   False
1        False     False   False  False  False  False  False  False   False
2        False     False   False  False  False  False  False  False   False

    Fare  Cabin  Embarked
0  False   True     False
1  False  False     False
2  False   True     False

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [263]:
# fillna()를 이용하여 비어있는 값을 채워줄 수 있습니다. (값을 변경하는 함수는 모두 inplace=True파라미터를 추가해야 원본데이터가 바뀝니다.)

# Age컬럼의 NaN를 평균값으로 대체하겠습니다.
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
print(titanic_df.isnull().sum())

# Age의 null값이 모두 채워진 것을 확인할 수 있습니다!

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [278]:
# pandas는 람다(lambda)를 사용할 수 있습니다.

# 람다가 무엇인지 간단히 설명하면

#예를 들어 어떤 수를 제곱하는 함수를 만들어 보겠습니다.
def get_square(a):
    return a**2
print('4의 제곱:',get_square(4))
# 위의 함수를 lambda식으로 변환합니다.
lambda_square = lambda x : x**2
print('4의 제곱:',lambda_square(4))

# 훨씬 더 간편하게 함수를 정리합니다.

4의 제곱: 16
4의 제곱: 16

In [279]:
# 타이타닉데이터에서 람다를 이용해 데이터 나이에 따른 분류 칼럼을 만들어 보겠습니다.

titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x < 15 else 'Adult')
print(titanic_df[['Age', 'Child_Adult']].head(8))
# 여기서 if의 위치가 값 뒤에 있다는 것을 주의하세요!

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [280]:
# head(), info(), drop(), DataFrame.loc[], Aggregation함수, groupby(), isnull(), fillna() 이것들이 판다스에서 어떤 역할을 하는지 확인해 보세요!